#include "Timer.h"

/*约1us时间产生1个外部脉冲，进入中断*/
void Timer0Init(void)		//1微秒@12.000MHz
{
	AUXR |= 0x80;		//定时器时钟1T模式
	TMOD |= 0x06;		//设置8位自动重载，外部脉冲计数模式（定时器用作外部脉冲计数）
	TL0 = 0xFF;		//设置定时初始值
	TH0 = 0xFF;		//设置定时重载值
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0用作计数(由于设置成外部脉冲计数模式所以用作计数器)
	ET0=1;
	EA=1;
}

void Timer1Init(void)		//1毫秒@12.000MHz
{
	AUXR |= 0x40;		//定时器时钟1T模式
	TMOD &= 0x0F;		//设置定时器模式
	TL1 = 0x20;		//设置定时初始值
	TH1 = 0xD1;		//设置定时初始值
	TF1 = 0;		//清除TF1标志
	TR1 = 1;		//定时器1等待开始计时
	
	ET1=1;
	EA=1;
}

void Timer2Init(void)		//1毫秒@12.000MHz
{
	AUXR |= 0x04;		//定时器时钟1T模式
	T2L = 0x20;		//设置定时初始值
	T2H = 0xD1;		//设置定时初始值
	AUXR |= 0x00;		//定时器2等待开始计时
	IE2|=0X04;
	EA=1;
}
